[
    {
        "brand_name": "Ray-Ban",
        "img": "https://i.ibb.co/HF6MP4h/sunglass-1.jpg",
        "price": 600,
        "star": "5",
        "description": "It's no surprise that Ray-Ban is the top pick for the best sunglasses brands in the world. After all, this heritage powerhouse has been making very high-quality, stylish sunglasses for more than 80 years — its Aviator-style shades were originally designed for military use but went “public” in 1937. Today, Ray-Ban's iconic Wayfarer sunglasses are one of the world’s most recognizable fashion accessories. They’ve been worn by equally iconic figures — from Muhammad Ali and President John F. Kennedy to Bob Dylan and Michael Jackson — which has helped Ray-Ban define “cool” for generations.Immense popularity also ensured that Ray-Ban shades made their way to the silver screen. For example, beloved actor Marlon Brando notably sported aviators in The Wild One, while Clint Eastwood made the Balorama model famous in Dirty Harry. Other well-known cinematic cameos include Tim Roth wearing Clubmaster frames in Reservoir Dogs and “The Blue Brothers” sporting Wayfarers. If you’re searching for an irresistible, movie-icon look, Ray-Ban should be your go-to brand. There’s a wide range of frame styles to choose from, plus various price points to suit most every budget — another reason Ray-Ban is a top brand despite tough competition from other sunglasses brands. "
    },
    {
        "brand_name": "Oakley",
        "img": "https://i.ibb.co/jfjh4sz/sunglass-2.jpg",
        "price": 100,
        "star": "5",
        "description": "Oakley is another popular brand that’s internationally renowned for its superior sunglasses. Since introducing its first pair of sunglasses — the Factory Pilot Eyeshades  model— in 1984, Oakley has been the brand of choice for people who participate in outdoor sports and activities. The sporty feel of the brand’s shades is now its signature, setting Oakley apart from the competition. Over several years, Oakley shades became a mainstream sunglasses brand, though of course they remain a must-have accessory for athletes and those with an active lifestyle. The company’s wider popularity reached its peak in the 1990s when it seemed as if almost everyone was wearing Oakley sunglasses. One key benefit to these sunglasses is that they pair sporty style with polarized lenses, which protect your eyes from unwanted glare and make it easier to see past reflections — especially on the water. This makes Oakley’s offerings perfect for people like American Olympic triathlete Gwen Jorgensen, who has had to compete in a variety of lighting conditions, or Olympic volleyball player Kerri Walsh, who has found sharper contrast between the ball and the sky when using these glasses.Non-athletes will also find these an ideal option, as they reduce glare during bright sunny days."
    },
    {
        "brand_name": "Maui Jim",
        "img": "https://i.ibb.co/vVZChKk/sunglass-3.jpg",
        "price": 500,
        "star": "4",
        "description": "This top-quality brand for a time produced its line of sunglasses solely in Hawaii, where company founders were first inspired to design shades that would combat the intense sunlight on the islands. Once they hit the mainland United States, sales of Maui Jim sunglasses soared. That’s because the brand provides quality lens technology that allows people to see colors more brilliantly and their surroundings more clearly. Today, these shades are beloved in the world of high fashion, and you can find both sporty and trendy sunglasses to suit every taste. They also offer the option of prescription or non-prescription lenses. Maui Jim successfully competes with other luxury brands due to the durable quality of its sunglasses. Frequent travelers and beach lovers especially love sporting Maui Jim."
    },
    {
        "brand_name": "American Optical",
        "img": "https://i.ibb.co/ftVtvBp/sunglass-4.jpg",
        "price": 100,
        "star": "3.7",
        "description": "American Optical is another famous sunglasses brand — as well as one of the world’s longest-running, with over two centuries of production.While their earliest sunglasses were simple eyeglasses featuring tinted lenses in various colors, American Optical over the years embraced innovative technology that would bring them to the forefront of the industry.The brand really grew in popularity in the mid-20th century when they created the sunglasses worn by astronaut Neil Armstrong and the other crew members of Apollo 11 during the world’s first moon landing,  an event watched on television by millions. American Optical is best known for producing sturdy, durable sunglasses — a pair from this top brand can easily last for years, making it a quality investment."
    },
    {
        "brand_name": "Tom Ford",
        "img": "https://i.ibb.co/WzQK9dz/sunglass-5.jpg",
        "price": 350,
        "star": "4.2",
        "description": "Since its inception in 2005, the Tom Ford brand has made its mark on the fashion industry. The founder, Tom Ford, is renowned internationally as one of the world’s most successful designers.  With 100% UV protection and slim frames for a stylish profile, Tom Ford sunglasses are in high demand and considered some of the best around. Among the famous designs are aviator, cat-eye and wraparound styles. Tom Ford’s sunglasses collection also includes large, square-shaped frames for those who want the all-out VIP look. It is the same style worn by Daniel Craig’s “James Bond” in the movie, Spectre!"
    },
    {
        "brand_name": "Persol",
        "img": "https://i.ibb.co/BzWLk0m/sunglass-6.jpg",
        "price": 150,
        "star": "4.1",
        "description": "Persol (which translates to “for sun”) is another popular sunglasses brand in the international scene. Like Ray-Ban, its history dates back to the 1900s. Persol introduced its hallmark yellow-brown lenses in 1920, but the brand didn’t become a massive hit until almost 50 years later when counterculture icon Steve McQueen sported a pair of Persol 714 sunglasses in the 1968 thriller, The Thomas Crown Affair. Since that appearance, the Steve McQueen Persol 714 has become the most popular of the brand’s wide range of styles. This brand offers durable sunglasses that are proven to last for many years. Additionally, Persol holds the patent for the world's first flexible stem system, a technology that allows you to lightly bend the sleek frames to better fit the shape of your face."
    },
    {
        "brand_name": "Oliver Peoples",
        "img": "https://i.ibb.co/5jYDGxN/sunglass-7.jpg",
        "price": 650,
        "star": "5",
        "description": "After beginning as a Hollywood brand in the 1980s, Oliver Peoples is still making waves in the fashion industry. The retro style, transformed to suit a range of modern looks, has helped Oliver Peoples become one of the world’s best sunglasses brands with designs that stand out from its competitors. Oliver Peoples sunglasses are known for their excellent detailing and distinct frames. Add to that the proprietary lenses with 100% protection from UVA and UVB rays, high-quality materials and seven-barrel hinges — versus the three-barrel hinges of standard glasses — and you’ve got a sunwear product that’s truly unique (and far more durable).Most recently, this popular brand has collaborated with the estates of movie stars Cary Grant and Gregory Peck, a reflection of its designers’ enduring inspiration — old Hollywood elegance and flair. "
    },
    {
        "brand_name": "Prada",
        "img": "https://i.ibb.co/LtQK7j8/sunglass-8.jpg",
        "price": 350,
        "star": "4.3",
        "description": "Founded in Italy by brothers Mario and Martino Prada, this brand has come to symbolize class, elegance and luxury. While the company may be best-known for high-end designer clothing and footwear, their chic and sophisticated sunglasses have become equally renowned by fashionistas and fashion critics from all over the world. The Prada brand defines sophistication and style, presenting a range of impeccable designs with frame choices that range from colorful and innovative to eccentric and vintage. Some sunglasses designs offered by Prada include butterfly, cat-eye and oval frames. No matter which style you choose, you’re sure to agree that Prada sunglasses are some of the best on the market today."
    },
    {
        "brand_name": "Mykita",
        "img": "https://i.ibb.co/hYTXwND/sunglass-9.jpg",
        "price": 750,
        "star": "4",
        "description": "Award-winning MYKITA is one of the top designer sunglasses brands around, known for fashionable shades that highlight superb craftsmanship. This brand offers sunglasses that are conceived of, designed, and then constructed by hand in-house using innovative technology that sets the company apart. While the general design aesthetic is simplicity, MYKITA sunglasses incorporate elegant solutions for even the smallest mechanics — evidenced by the patented spiral hinge and other functional elements that have become stylish features of their shades.The company is also unique in that it has collaborated with other popular sunglasses brands, such as Maison Margiela and Moncler. With durability and style to spare, MYKITA sunglasses will last for many years, all while keeping you at the height of fashion."
    },
    {
        "brand_name": "Randolph",
        "img": "https://i.ibb.co/8zPD6ZZ/sunglass-10.jpg",
        "price": 50,
        "star": "1",
        "description": "Randolph is a luxury sunglasses brand offering some of the most indestructible eyewear on the market. The company guarantees superior products, and those claims of quality are backed by loyal customers, including the United States government, which has been outfitting its military pilots with Randolph sunglasses for decades. That’s in part because the lenses are anti-reflective, scratch-resistant, distortion-free, and block 100% of the sun’s UVA and UVB rays for maximum eye protection. These sunglasses also happen to be very stylish. Many famous Hollywood celebrities — including Tom Cruise, Ellen DeGeneres, Johnny Depp and Amy Adams — regularly wear Randolph sunglasses in their daily lives, while others rock them on big and small screens everywhere. The Aviator model, for instance, has been spotted on Jon Hamm in Mad Men, Brie Larsen in Captain Marvel and Wendell Pierce in Jack Ryan, among many others. "
    },
    {
        "brand_name": "Versace",
        "img": "https://i.ibb.co/pnb3dfh/sunglass-11.jpg",
        "price": 850,
        "star": "0",
        "description": "There is nothing subtle about the house of Versace, which is what we love about the Italian heritage brand. Known for bold prints and sharp, intricate designs, this brand is just as dominant today as it was 20 years ago. Not afraid to push the boundaries of fashion, Versace accessories are not only unique statement pieces but a part of future fashion history."
    },
    {
        "brand_name": "Burberry",
        "img": "https://i.ibb.co/pfSLMTz/sunglass-12.jpg",
        "price": 150,
        "star": "2.8",
        "description": "Since changing the face of rainwear with the invention of gabardine in 1879, Burberry has become the synonym for classic British design and style. With Christopher Bailey at the helm for the past 17 years, the brand has experienced a revival, seamlessly merging its signature elements with trendy, contemporary additions."
    }
    
]